#include <iostream>
using namespace std;

int main() {
    // freopen("turtle.in", "r", stdin);
    // freopen("turtle.out", "w", stdout);

    int h, w, i, j, k, g; // кол-во строк // кол-во столбцов
    cin >> h >> w;
    int a[h][w];


    for (i = 1; i <= h; i++) {
        for (j = 1; j <= w; j++) {
            cin >> a[i][j];
        }
    }
    
    // n высота, m ширина в данный момент
    int n = h;
    int m = 1;
    int sum = a[h][1];

    // Ф-ция сравнения верхнего значения и правого, и переход туда, где больше

    for (i = 0; i < h*w; i++) {

        if (n == 1 && m == w) {
            cout << sum;
            return 0;
        }

        if (a[n - 1][m] > a[n][m + 1]) { // Перейти вверх, если значение сверху больше
            sum += a[n - 1][m];
            n -= 1;
        }
        if (a[n][m + 1] > a[n - 1][m]) { // Перейти вправо, если значение справа больше
            sum += a[n][m + 1];
            m += 1;
        }
        if (a[n][m + 1] == a[n - 1][m]) {

            n -= 1; // Перейти вверх

            if (a[n - 1][m] > a[n][m + 1]) { // Перейти вверх, если значение сверху больше
                k += a[n - 1][m];
            }
            if (a[n][m + 1] > a[n - 1][m]) { // Перейти вправо, если значение справа больше
                k += a[n][m + 1];
            }
            if (n == 1) {
                k += a[n][m + 1];
            }
            if (m == w) {
                k += a[n - 1][m];
            }

            n += 1; // Перейти вниз
            m += 1; // Перейти вправо

            if (a[n - 1][m] > a[n][m + 1]) { // Перейти вверх, если значение сверху больше
                g += a[n - 1][m];
            }
            if (a[n][m + 1] > a[n - 1][m]) { // Перейти вправо, если значение справа больше
                g += a[n][m + 1];
            }
            if (n == 1) {
                g += a[n][m + 1];
                m += 1;
            }
            if (m == w) {
                g += a[n - 1][m];
                n -= 1;
            }

            if (k > g) {
                sum += a[n - 1][m];
                n -= 1;
            } else if (k < g) {
                sum += a[n][m + 1];
                m += 1;
            }

        }
        if (m == w) { // Перейти вверх, если клетки справа нет
            sum += a[n - 1][m];
            n -= 1;
        }
        if (n == 1) { // Перейти вправо, если клетки сверху нет
            sum += a[n][m + 1];
            m += 1;
        }

    }
    cout << sum;

}